#### In this exercise, we will perform some data cleaning tasks: 
(i) checkness for completeness, (ii) merging/ appending, (iii) checking of values to ensure validity, (iv) de-duplication, (v) recoding.

In [1]:
# The dataset Class1.csv can be found here: 
# https://github.com/hxchua/datadoubleconfirm/tree/master/notebooks 
data1<-read.csv("Class1.csv",header=T)

In [2]:
# checking if the number of rows in the dataset was as expected
nrow(data1)

[1] 100

In [3]:
# checking if the number of columns in the dataset was as expected
ncol(data1)

[1] 5

In [4]:
# finding out the variable names of each column
colnames(data1)

[1] "id"     "gender" "test1"  "test2"  "test3"

In [5]:
# finding out the ranges of values for each variable to check validity
summary(data1)

       id            gender       test1           test2           test3
 Min.   :  1.00   Female:50   Min.   : 1.00   Min.   :36.00   Min.   :40.00
 1st Qu.: 25.75   Male  :50   1st Qu.:12.25   1st Qu.:52.00   1st Qu.:52.00
 Median : 50.50               Median :17.50   Median :55.50   Median :57.00
 Mean   : 50.50               Mean   :19.66   Mean   :56.08   Mean   :57.09
 3rd Qu.: 75.25               3rd Qu.:26.75   3rd Qu.:60.75   3rd Qu.:63.00
 Max.   :100.00               Max.   :41.00   Max.   :75.00   Max.   :79.00
                              NA's   :10      NA's   :10

In [6]:
# finding out rows with missing data
data1[rowSums(is.na(data1)) > 0,]

   id gender test1 test2 test3
5   5 Male   NA    37    68
6   6 Male   18    NA    66
10 10 Male   NA    51    62
12 12 Male   17    NA    54
15 15 Male   NA    59    52
18 18 Male   12    NA    48
20 20 Male   NA    60    57
24 24 Male   39    NA    52
25 25 Male   NA    48    47
30 30 Male   NA    NA    60
35 35 Male   NA    56    52
36 36 Male   36    NA    66
40 40 Male   NA    59    56
42 42 Male   16    NA    64
45 45 Male   NA    43    61
48 48 Male   30    NA    54
50 50 Male   NA    45    43
54 54 Female 37    NA    56
60 60 Female 38    NA    69

#### Say, I have a new dataset on scores of test 4.

In [7]:
set.seed(1)
test<-matrix(,100,2)
for (i in 1:100){
    test[i,1]<-i
    test[i,2]<-round(rnorm(1,62,7))
}

In [8]:
colnames(test)<-c("id","test4")

In [9]:
head(test)

     id test4
[1,] 1  58
[2,] 2  63
[3,] 3  56
[4,] 4  73
[5,] 5  64
[6,] 6  56

#### I want to merge this dataset with the original dataset consisting the three test scores.

In [10]:
data2<-merge(data1,test, on="id")

In [11]:
summary(data2)

       id            gender       test1           test2           test3
 Min.   :  1.00   Female:50   Min.   : 1.00   Min.   :36.00   Min.   :40.00
 1st Qu.: 25.75   Male  :50   1st Qu.:12.25   1st Qu.:52.00   1st Qu.:52.00
 Median : 50.50               Median :17.50   Median :55.50   Median :57.00
 Mean   : 50.50               Mean   :19.66   Mean   :56.08   Mean   :57.09
 3rd Qu.: 75.25               3rd Qu.:26.75   3rd Qu.:60.75   3rd Qu.:63.00
 Max.   :100.00               Max.   :41.00   Max.   :75.00   Max.   :79.00
                              NA's   :10      NA's   :10
     test4
 Min.   :46.00
 1st Qu.:58.75
 Median :63.00
 Mean   :62.74
 3rd Qu.:67.00
 Max.   :79.00

#### Say, I have a batch of student results that was accidentally omitted and now they are provided to me. Now I want to append these results together.

In [12]:
# The dataset Class2.csv can be found here: 
# https://github.com/hxchua/datadoubleconfirm/tree/master/notebooks 
new<-read.csv("Class2.csv",header=T)

In [13]:
head(new)

  id gender test1 test2 test3 test4
1 91 Female 37    53    50    75
2 92 Female 42    45    59    69
3 93 Female 43    50    67    67
4 94 Female 37    34    64    65
5 95 Female 40    60    62    69
6 96 Female 45    58    57    53

In [14]:
# note that there are ids similar in Class1 as the minimum id is less than 100 
summary(new)

       id           gender       test1          test2           test3
 Min.   : 91.0   Female:50   Min.   :27.0   Min.   :34.00   Min.   :41.00
 1st Qu.:115.8   Male  :50   1st Qu.:37.0   1st Qu.:47.00   1st Qu.:52.75
 Median :140.5               Median :39.0   Median :52.00   Median :57.00
 Mean   :140.5               Mean   :39.6   Mean   :52.96   Mean   :56.88
 3rd Qu.:165.2               3rd Qu.:43.0   3rd Qu.:58.25   3rd Qu.:62.00
 Max.   :190.0               Max.   :52.0   Max.   :73.00   Max.   :72.00
     test4
 Min.   :48.00
 1st Qu.:62.00
 Median :65.00
 Mean   :65.01
 3rd Qu.:68.25
 Max.   :77.00

In [15]:
# appending the data together
data3<-rbind(data2,new)

In [16]:
summary(data3)

       id            gender        test1           test2           test3
 Min.   :  1.00   Female:100   Min.   : 1.00   Min.   :34.00   Min.   :40.00
 1st Qu.: 50.75   Male  :100   1st Qu.:18.25   1st Qu.:50.00   1st Qu.:52.00
 Median : 95.50                Median :35.00   Median :54.00   Median :57.00
 Mean   : 95.50                Mean   :30.15   Mean   :54.44   Mean   :56.98
 3rd Qu.:140.25                3rd Qu.:40.00   3rd Qu.:59.75   3rd Qu.:63.00
 Max.   :190.00                Max.   :52.00   Max.   :75.00   Max.   :79.00
                               NA's   :10      NA's   :10
     test4
 Min.   :46.00
 1st Qu.:60.75
 Median :64.00
 Mean   :63.88
 3rd Qu.:68.00
 Max.   :79.00

#### We noticed that there are some duplicate records after appending and so we want to drop the older records as, say, we found out that those older records were erroneous.

In [17]:
data4<-data3[!rev(duplicated(rev(data3$id))),]

In [18]:
summary(data4)

       id            gender        test1           test2           test3
 Min.   :  1.00   Female: 90   Min.   : 1.00   Min.   :34.00   Min.   :40.00
 1st Qu.: 48.25   Male  :100   1st Qu.:18.75   1st Qu.:50.00   1st Qu.:52.00
 Median : 95.50                Median :36.00   Median :54.00   Median :57.00
 Mean   : 95.50                Mean   :30.53   Mean   :54.33   Mean   :57.05
 3rd Qu.:142.75                3rd Qu.:40.25   3rd Qu.:60.00   3rd Qu.:63.00
 Max.   :190.00                Max.   :52.00   Max.   :75.00   Max.   :79.00
                               NA's   :10      NA's   :10
     test4
 Min.   :46.00
 1st Qu.:61.00
 Median :64.00
 Mean   :63.94
 3rd Qu.:67.75
 Max.   :79.00

#### Say, I have some students who had missed test 2 decided to retake.

In [19]:
retake<-matrix(c(24,60,30,50,54,52),nc=2)

In [20]:
colnames(retake)<-c("id","retest2")

In [21]:
retake

     id retest2
[1,] 24 50
[2,] 60 54
[3,] 30 52

In [22]:
# doing a vlookup
base1 <- merge(data4, retake, by = 'id')

In [23]:
base1

  id gender test1 test2 test3 test4 retest2
1 24 Male   39    NA    52    48    50
2 30 Male   NA    NA    60    65    52
3 60 Female 38    NA    69    61    54

In [24]:
# updating test2 with retest2 scores
base1$test2<-base1$retest2

In [25]:
base1

  id gender test1 test2 test3 test4 retest2
1 24 Male   39    50    52    48    50
2 30 Male   NA    52    60    65    52
3 60 Female 38    54    69    61    54

In [26]:
# we only want the first six columns 
base1<-base1[,1:6]

In [27]:
# we append the dataset and drop the duplicates again
data5<-rbind(data4,base1)
data5<-data5[!rev(duplicated(rev(data5$id))),]

In [28]:
# note that the number of NA's for test2 has reduced
summary(data5)

       id            gender        test1           test2          test3
 Min.   :  1.00   Female: 90   Min.   : 1.00   Min.   :34.0   Min.   :40.00
 1st Qu.: 48.25   Male  :100   1st Qu.:18.75   1st Qu.:50.0   1st Qu.:52.00
 Median : 95.50                Median :36.00   Median :54.0   Median :57.00
 Mean   : 95.50                Mean   :30.53   Mean   :54.3   Mean   :57.05
 3rd Qu.:142.75                3rd Qu.:40.25   3rd Qu.:59.5   3rd Qu.:63.00
 Max.   :190.00                Max.   :52.00   Max.   :75.0   Max.   :79.00
                               NA's   :10      NA's   :7
     test4
 Min.   :46.00
 1st Qu.:61.00
 Median :64.00
 Mean   :63.94
 3rd Qu.:67.75
 Max.   :79.00

In [29]:
# check that the correct records are kept
data5[data5$id==24 | data5$id==30 | data5$id==60, ]

     id gender test1 test2 test3 test4
1100 24 Male   39    50    52    48
210  30 Male   NA    52    60    65
310  60 Female 38    54    69    61

#### Sometimes, we want to replace missing data with zero (but note that this will skew the statistics) or the column mean (this will retain the distribution).

In [30]:
# if we want to replace missing values with zero
data6<-data5
data6[is.na(data6)]<-0

In [31]:
# the statistics for test1 and test2 has changed
summary(data6)

       id            gender        test1           test2           test3
 Min.   :  1.00   Female: 90   Min.   : 0.00   Min.   : 0.00   Min.   :40.00
 1st Qu.: 48.25   Male  :100   1st Qu.:17.00   1st Qu.:49.00   1st Qu.:52.00
 Median : 95.50                Median :34.50   Median :54.00   Median :57.00
 Mean   : 95.50                Mean   :28.93   Mean   :52.29   Mean   :57.05
 3rd Qu.:142.75                3rd Qu.:40.00   3rd Qu.:59.00   3rd Qu.:63.00
 Max.   :190.00                Max.   :52.00   Max.   :75.00   Max.   :79.00
     test4
 Min.   :46.00
 1st Qu.:61.00
 Median :64.00
 Mean   :63.94
 3rd Qu.:67.75
 Max.   :79.00

In [32]:
# if we want to replace missing values with column mean
data7<-data5
for(i in 1:ncol(data7)){
  data7[is.na(data7[,i]), i] <- mean(data7[,i], na.rm = TRUE)
}

Warning message in mean.default(data7[, i], na.rm = TRUE):
"argument is not numeric or logical: returning NA"

In [33]:
# the statistics for test1 and test2 has changed
summary(data7)

       id            gender        test1           test2          test3
 Min.   :  1.00   Female: 90   Min.   : 1.00   Min.   :34.0   Min.   :40.00
 1st Qu.: 48.25   Male  :100   1st Qu.:20.25   1st Qu.:50.0   1st Qu.:52.00
 Median : 95.50                Median :34.50   Median :54.0   Median :57.00
 Mean   : 95.50                Mean   :30.53   Mean   :54.3   Mean   :57.05
 3rd Qu.:142.75                3rd Qu.:40.00   3rd Qu.:59.0   3rd Qu.:63.00
 Max.   :190.00                Max.   :52.00   Max.   :75.0   Max.   :79.00
     test4
 Min.   :46.00
 1st Qu.:61.00
 Median :64.00
 Mean   :63.94
 3rd Qu.:67.75
 Max.   :79.00

#### We might also want to recode some values. For example, there is a moderation in scores and the minimum score for test 1 is moderated to be 15.

In [34]:
data8<-data5
data8$test1[data8$test1<15]<-15

In [35]:
summary(data8)

       id            gender        test1           test2          test3
 Min.   :  1.00   Female: 90   Min.   :15.00   Min.   :34.0   Min.   :40.00
 1st Qu.: 48.25   Male  :100   1st Qu.:18.75   1st Qu.:50.0   1st Qu.:52.00
 Median : 95.50                Median :36.00   Median :54.0   Median :57.00
 Mean   : 95.50                Mean   :31.45   Mean   :54.3   Mean   :57.05
 3rd Qu.:142.75                3rd Qu.:40.25   3rd Qu.:59.5   3rd Qu.:63.00
 Max.   :190.00                Max.   :52.00   Max.   :75.0   Max.   :79.00
                               NA's   :10      NA's   :7
     test4
 Min.   :46.00
 1st Qu.:61.00
 Median :64.00
 Mean   :63.94
 3rd Qu.:67.75
 Max.   :79.00